<a href="https://colab.research.google.com/github/dscoool/waterai/blob/main/3_Pandas_DataFrame.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

![alt text](https://miro.medium.com/max/2400/1*9v51-jsfHtk6fgAIYLoiHQ.jpeg)

# Pandas 데이터프레임 다루기

## 1. Pandas 데이터프레임(DataFrame) 만들기

데이터프레임은 파이썬에서 '테이블'과 유사한 개념입니다.

가로 세로 일정한 데이터(csv, xls)를 데이터프레임이라는

형식을 사용하여 다룹니다.

In [3]:
import pandas as pd


데이터프레임을 생성해 봅시다!

pd.DataFrame() 명령어를 사용합니다. D와 F가 대문자임에 유의합시다.

아래와 같이 내용을 입력해 봅시다.

In [4]:
df = pd.DataFrame({'Company Name':['Google', 'Microsoft', 'SpaceX', 'Amazon', 'Samsung'],
                   'Founders':['Larry Page, Sergey Brin', 'Bill Gates, Paul Allen',
                               'Elon Musk','Jeff Bezos', 'Lee Byung-chul'],
                   'Founded': [1998, 1975, 2002, 1994, 1938],
                   'Number of Employees': ['103,459', '144,106', '6,500', '647,500', '320,671']})

df 를 타이핑하여 데이터프레임을 출력해 봅시다!!

In [5]:
df

  Company Name                 Founders  Founded Number of Employees
0       Google  Larry Page, Sergey Brin     1998             103,459
1    Microsoft   Bill Gates, Paul Allen     1975             144,106
2       SpaceX                Elon Musk     2002               6,500
3       Amazon               Jeff Bezos     1994             647,500
4      Samsung           Lee Byung-chul     1938             320,671

## 2. 데이터 프레임에 한 행추가 하기

행추가를 하기 위해, 한 행을 df1이라는 별도 데이터프레임으로 생성합니다.

In [6]:
df1 = pd.DataFrame({'Company Name':['WhatsApp'], 'Founders':['Jan Koum, Brian Acton'], 'Founded': [2009], 'Number of Employees': ['50'] })

df1의 내용을 출력해 봅시다.

In [7]:
df1

  Company Name               Founders  Founded Number of Employees
0     WhatsApp  Jan Koum, Brian Acton     2009                  50

이제 df + df1 을 해 봅시다 두 데이터프레임을 append 명령어를 사용하여 세로로 더합니다.

In [9]:
df = df.append(df1, ignore_index=True)
df

<ipython-input-9-c293e8f30219>:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(df1, ignore_index=True)

  Company Name                 Founders  Founded Number of Employees
0       Google  Larry Page, Sergey Brin     1998             103,459
1    Microsoft   Bill Gates, Paul Allen     1975             144,106
2       SpaceX                Elon Musk     2002               6,500
3       Amazon               Jeff Bezos     1994             647,500
4      Samsung           Lee Byung-chul     1938             320,671
5     WhatsApp    Jan Koum, Brian Acton     2009                  50
6     WhatsApp    Jan Koum, Brian Acton     2009                  50

**Case 2: 특정 위치에 한 행 추가하기**

세번째 줄에 아래와 같은 데이터행을 추가해 봅시다.

In [ ]:
df.iloc[3] = ['YouTube', 'Chad Hurley, Steve Chen, Jawed Karim', 2005, '2,800']
df

  Company Name  ... Number of Employees
0       Google  ...             103,459
1    Microsoft  ...             144,106
2       SpaceX  ...               6,500
3      YouTube  ...               2,800
4      Samsung  ...             320,671
5     WhatsApp  ...                  50

[6 rows x 4 columns]

## 3. 데이터프레임에서 한 행 삭제하기

**Case 1: index 를 사용하여 한 행 삭제하기**

아래 명령어로 5번 행 전체를 지워 봅시다.

In [10]:
df = df.drop([df.index[5]])
df

  Company Name                 Founders  Founded Number of Employees
0       Google  Larry Page, Sergey Brin     1998             103,459
1    Microsoft   Bill Gates, Paul Allen     1975             144,106
2       SpaceX                Elon Musk     2002               6,500
3       Amazon               Jeff Bezos     1994             647,500
4      Samsung           Lee Byung-chul     1938             320,671
6     WhatsApp    Jan Koum, Brian Acton     2009                  50

**Case 2: Founder 이름을 지정하여 한 행을 삭제해 봅시다**

Founders 가 'Chad Hurley, Steve Chen, Jawed Karim'와 같지 않으면 해당 행을 삭제합니다.

In [ ]:
!= 는 같지 않음을 나타내는 연산자입니다.

A!=B    A와 B가 같지 않을 경우

In [12]:
df.Founders != 'Chad Hurley, Steve Chen, Jawed Karim'

0    True
1    True
2    True
3    True
4    True
6    True
Name: Founders, dtype: bool

In [13]:
df[df.Founders != 'Chad Hurley, Steve Chen, Jawed Karim']

  Company Name                 Founders  Founded Number of Employees
0       Google  Larry Page, Sergey Brin     1998             103,459
1    Microsoft   Bill Gates, Paul Allen     1975             144,106
2       SpaceX                Elon Musk     2002               6,500
3       Amazon               Jeff Bezos     1994             647,500
4      Samsung           Lee Byung-chul     1938             320,671
6     WhatsApp    Jan Koum, Brian Acton     2009                  50

In [11]:
df = df[df.Founders != 'Chad Hurley, Steve Chen, Jawed Karim']
df

  Company Name                 Founders  Founded Number of Employees
0       Google  Larry Page, Sergey Brin     1998             103,459
1    Microsoft   Bill Gates, Paul Allen     1975             144,106
2       SpaceX                Elon Musk     2002               6,500
3       Amazon               Jeff Bezos     1994             647,500
4      Samsung           Lee Byung-chul     1938             320,671
6     WhatsApp    Jan Koum, Brian Acton     2009                  50

Now the **YouTube** company’s row is deleted with the help of providing its values.



---



## 4. loc 명령어를 사용하여 데이터 접근하기

loc (location) 명령어를 사용하여 상대좌표로 데이터를 출력해 봅시다!!

In [14]:
df.loc[2]

Company Name              SpaceX
Founders               Elon Musk
Founded                     2002
Number of Employees        6,500
Name: 2, dtype: object



---

## 5. 데이터프레임 값 변경하기

.at[x,y] 명령어도 iloc 명령어와 비슷한 역할을 합니다.
데이터프레임의 x행의 y열을 나타냅니다.

In [15]:
df.at[1, 'Number of Employees']

'144,106'

In [16]:
df.at[1, 'Number of Employees'] = '200,000'
df # This is after the change of value (Microsoft)

  Company Name                 Founders  Founded Number of Employees
0       Google  Larry Page, Sergey Brin     1998             103,459
1    Microsoft   Bill Gates, Paul Allen     1975             200,000
2       SpaceX                Elon Musk     2002               6,500
3       Amazon               Jeff Bezos     1994             647,500
4      Samsung           Lee Byung-chul     1938             320,671
6     WhatsApp    Jan Koum, Brian Acton     2009                  50

In [17]:
df  # This is before the change of value (Microsoft)

  Company Name                 Founders  Founded Number of Employees
0       Google  Larry Page, Sergey Brin     1998             103,459
1    Microsoft   Bill Gates, Paul Allen     1975             200,000
2       SpaceX                Elon Musk     2002               6,500
3       Amazon               Jeff Bezos     1994             647,500
4      Samsung           Lee Byung-chul     1938             320,671
6     WhatsApp    Jan Koum, Brian Acton     2009                  50